# AddLoop Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionData..::..AddLoop Method
IFCExtrusionData Class See Also
---
Adds a curve loop to the extrusion data.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void AddLoop(
	CurveLoop pLoop
)
```

Visual Basic
---
```text
Public Sub AddLoop ( _
	pLoop As CurveLoop _
)
```

Visual C++
---
```text
public:
void AddLoop(
	CurveLoop^ pLoop
)
```

# ### Parameters
pLoop
    Type: Autodesk.Revit.DB..::..CurveLoop The curve loop.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace